package functions;


/**
 * Интерфейс, определяющий действия любой функции
 */
public interface FunctionImpl {

    /**
     * Метод получения левой границы области определения функции
     *
     * @return - возвращает левую границу области определения
     */
    double getLeftDomainBorder();

    /**
     * Метод получения правой границы области определения функции
     *
     * @return - возвращает правую границу области определения
     */
    double getRightDomainBorder();

    /**
     * Находить значение функции по заданной точке
     *
     * @param x - аргумент, в котором нужно найти значение нашей функции
     * @return - возвращает значение функции в точке х
     */
    double getFunctionValue(double x);
}
